In [2]:
import numpy as np
import pandas as pd

In [3]:
%%writefile example1.csv
a, b, c, d, e, text
1, 2, 3, 4, 5, hi
6, 7, 8, 9, 10, pandas
11, 12, 13, 14, 15, csv

Writing example1.csv

In [4]:
!ls

example1.csv  sample_data

In [5]:
pd.read_csv('example1.csv')

    a   b   c   d   e     text
0   1   2   3   4   5       hi
1   6   7   8   9  10   pandas
2  11  12  13  14  15      csv

In [6]:
%%writefile example2.csv
1, 2, 3, 4, 5, hi
6, 7, 8, 9, 10, pandas
11, 12, 13, 14, 15, csv

Writing example2.csv

In [7]:
pd.read_csv('example2.csv', header=None)

    0   1   2   3   4        5
0   1   2   3   4   5       hi
1   6   7   8   9  10   pandas
2  11  12  13  14  15      csv

In [8]:
pd.read_csv('example2.csv', names=['a', 'b', 'c', 'd', 'e', 'text'])

    a   b   c   d   e     text
0   1   2   3   4   5       hi
1   6   7   8   9  10   pandas
2  11  12  13  14  15      csv

In [9]:
pd.read_csv('example2.csv', names=['a', 'b', 'c', 'd', 'e', 'text'], index_col='text')

          a   b   c   d   e
text
 hi       1   2   3   4   5
 pandas   6   7   8   9  10
 csv     11  12  13  14  15

In [10]:
%%writefile example3.txt
     a     b     c
1  0.1   0.2   0.3
2  0.4   0.5   0.6
3  0.7   0.8   0.9

Writing example3.txt

In [11]:
pd.read_table('example3.txt', sep='\s+')

     a    b    c
1  0.1  0.2  0.3
2  0.4  0.5  0.6
3  0.7  0.8  0.9

In [12]:
%%writefile example4.csv
# 파일 설명
a, b, c, d, e, text
# 컬럼은 a, b, c ,d, e와 text가 있음
1, 2, 3, 4, 5, hi
6, 7, 8, 9, 10, pandas
11, 12, 13, 14, 15, csv

Writing example4.csv

In [13]:
pd.read_csv('example4.csv', skiprows=[0, 2])

    a   b   c   d   e     text
0   1   2   3   4   5       hi
1   6   7   8   9  10   pandas
2  11  12  13  14  15      csv

In [14]:
%%writefile example5.csv
a, b, c, d, e, text
1, 2, NA, 4, 5, hi
6, 7, 8, NULL, 10, pandas
11, NA, 13, 14, 15, csv

Writing example5.csv

In [15]:
pd.read_csv('example5.csv')

    a    b    c      d   e     text
0   1    2   NA      4   5       hi
1   6    7    8   NULL  10   pandas
2  11   NA   13     14  15      csv

In [16]:
%%writefile example6.csv
a, b, c, d, e, text
1, 2, 3, 4, 5, hi
6, 7, 8, 9, 10, pandas
11, 12, 13, 14, 15, csv
1, 2, 3, 4, 5, hi
6, 7, 8, 9, 10, pandas
11, 12, 13, 14, 15, csv
1, 2, 3, 4, 5, hi
6, 7, 8, 9, 10, pandas
11, 12, 13, 14, 15, csv
1, 2, 3, 4, 5, hi
6, 7, 8, 9, 10, pandas
11, 12, 13, 14, 15, csv
1, 2, 3, 4, 5, hi
6, 7, 8, 9, 10, pandas
11, 12, 13, 14, 15, csv

Writing example6.csv

In [17]:
pd.read_csv('example6.csv', nrows=5)

    a   b   c   d   e     text
0   1   2   3   4   5       hi
1   6   7   8   9  10   pandas
2  11  12  13  14  15      csv
3   1   2   3   4   5       hi
4   6   7   8   9  10   pandas

In [18]:
df = pd.read_csv('example6.csv')
df

     a   b   c   d   e     text
0    1   2   3   4   5       hi
1    6   7   8   9  10   pandas
2   11  12  13  14  15      csv
3    1   2   3   4   5       hi
4    6   7   8   9  10   pandas
5   11  12  13  14  15      csv
6    1   2   3   4   5       hi
7    6   7   8   9  10   pandas
8   11  12  13  14  15      csv
9    1   2   3   4   5       hi
10   6   7   8   9  10   pandas
11  11  12  13  14  15      csv
12   1   2   3   4   5       hi
13   6   7   8   9  10   pandas
14  11  12  13  14  15      csv

In [19]:
df.to_csv('output.csv')

In [20]:
!cat output.csv

,a, b, c, d, e, text
0,1,2,3,4,5, hi
1,6,7,8,9,10, pandas
2,11,12,13,14,15, csv
3,1,2,3,4,5, hi
4,6,7,8,9,10, pandas
5,11,12,13,14,15, csv
6,1,2,3,4,5, hi
7,6,7,8,9,10, pandas
8,11,12,13,14,15, csv
9,1,2,3,4,5, hi
10,6,7,8,9,10, pandas
11,11,12,13,14,15, csv
12,1,2,3,4,5, hi
13,6,7,8,9,10, pandas
14,11,12,13,14,15, csv

In [21]:
dr = pd.date_range('2021-01-01', periods=10)
ts = pd.Series(np.arange(10), index=dr)
ts

2021-01-01    0
2021-01-02    1
2021-01-03    2
2021-01-04    3
2021-01-05    4
2021-01-06    5
2021-01-07    6
2021-01-08    7
2021-01-09    8
2021-01-10    9
Freq: D, dtype: int64

In [22]:
ts.to_csv('ts.csv', header=['value'])

In [23]:
!cat ts.csv

,value
2021-01-01,0
2021-01-02,1
2021-01-03,2
2021-01-04,3
2021-01-05,4
2021-01-06,5
2021-01-07,6
2021-01-08,7
2021-01-09,8
2021-01-10,9

In [34]:
%%writefile example.json
[{"a":1, "b":2, "c":3, "d":4, "e":5},
 {"a":6, "b":7, "c":8, "d":9, "e":10},
 {"a":11, "b":12, "c":13, "d":14, "e":15}]

Overwriting example.json

In [35]:
!cat example.json

[{"a":1, "b":2, "c":3, "d":4, "e":5},
 {"a":6, "b":7, "c":8, "d":9, "e":10},
 {"a":11, "b":12, "c":13, "d":14, "e":15}]

In [36]:
pd.read_json('example.json')

    a   b   c   d   e
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [37]:
ts.to_json("output.json")

In [38]:
!cat output.json

{"1609459200000":0,"1609545600000":1,"1609632000000":2,"1609718400000":3,"1609804800000":4,"1609891200000":5,"1609977600000":6,"1610064000000":7,"1610150400000":8,"1610236800000":9}

In [39]:
df.to_json('output.json')

In [40]:
!cat output.json

{"a":{"0":1,"1":6,"2":11,"3":1,"4":6,"5":11,"6":1,"7":6,"8":11,"9":1,"10":6,"11":11,"12":1,"13":6,"14":11}," b":{"0":2,"1":7,"2":12,"3":2,"4":7,"5":12,"6":2,"7":7,"8":12,"9":2,"10":7,"11":12,"12":2,"13":7,"14":12}," c":{"0":3,"1":8,"2":13,"3":3,"4":8,"5":13,"6":3,"7":8,"8":13,"9":3,"10":8,"11":13,"12":3,"13":8,"14":13}," d":{"0":4,"1":9,"2":14,"3":4,"4":9,"5":14,"6":4,"7":9,"8":14,"9":4,"10":9,"11":14,"12":4,"13":9,"14":14}," e":{"0":5,"1":10,"2":15,"3":5,"4":10,"5":15,"6":5,"7":10,"8":15,"9":5,"10":10,"11":15,"12":5,"13":10,"14":15}," text":{"0":" hi","1":" pandas","2":" csv","3":" hi","4":" pandas","5":" csv","6":" hi","7":" pandas","8":" csv","9":" hi","10":" pandas","11":" csv","12":" hi","13":" pandas","14":" csv"}}

## 이진 데이터 파일 읽기 / 쓰기

In [41]:
df = pd.read_csv('example1.csv')
df

    a   b   c   d   e     text
0   1   2   3   4   5       hi
1   6   7   8   9  10   pandas
2  11  12  13  14  15      csv

In [42]:
df.to_pickle('df_pickle')
pd.read_pickle('df_pickle')

    a   b   c   d   e     text
0   1   2   3   4   5       hi
1   6   7   8   9  10   pandas
2  11  12  13  14  15      csv

In [43]:
df = pd.DataFrame({'a':np.random.randn(100),
                   'b':np.random.randn(100),
                   'c':np.random.randn(100)})
df

           a         b         c
0  -0.935313 -1.646714  0.288740
1   0.801716 -0.219507 -2.147780
2   0.912506 -0.133249 -0.921406
3   1.314931 -0.569361  1.144766
4   0.369215 -2.479816 -0.349906
..       ...       ...       ...
95  1.035640  0.129676 -0.439380
96 -0.264234 -0.152521  2.035761
97  1.379658  0.848404  1.324203
98 -0.207253 -0.428760 -2.058538
99  0.154417 -1.049905 -0.229660

[100 rows x 3 columns]

In [44]:
h = pd.HDFStore('date.h5')
h['obj1'] = df
h['obj1_col1'] = df['a']
h['obj1_col2'] = df['b']
h['obj1_col3'] = df['c']
h

<class 'pandas.io.pytables.HDFStore'>
File path: date.h5

In [45]:
h['obj1']

           a         b         c
0  -0.935313 -1.646714  0.288740
1   0.801716 -0.219507 -2.147780
2   0.912506 -0.133249 -0.921406
3   1.314931 -0.569361  1.144766
4   0.369215 -2.479816 -0.349906
..       ...       ...       ...
95  1.035640  0.129676 -0.439380
96 -0.264234 -0.152521  2.035761
97  1.379658  0.848404  1.324203
98 -0.207253 -0.428760 -2.058538
99  0.154417 -1.049905 -0.229660

[100 rows x 3 columns]

In [46]:
h.put('obj2', df, format='table')

In [47]:
h.select('obj2', where='index > 50 and index <= 60')

           a         b         c
51  0.885524 -1.939437  0.882858
52  2.053541 -1.162306 -1.099877
53 -0.564032  1.020768  1.284132
54  0.298115  0.141538  1.215971
55  0.016292 -0.297168  0.163106
56  1.271567 -0.576035 -1.819398
57 -0.665918  0.717221 -0.771451
58 -1.110903 -0.682704 -0.070726
59 -0.926664  0.199962  1.385450
60  0.817364 -0.097213  1.407828

In [48]:
h.close()

In [49]:
df.to_hdf('data.h5', 'obj3', format='table')

In [50]:
pd.read_hdf('data.h5', 'obj3', where=['index < 10'])

          a         b         c
0 -0.935313 -1.646714  0.288740
1  0.801716 -0.219507 -2.147780
2  0.912506 -0.133249 -0.921406
3  1.314931 -0.569361  1.144766
4  0.369215 -2.479816 -0.349906
5 -1.759737  0.823228  1.692762
6  2.607972 -0.238124 -0.180180
7  2.118557  1.225974  0.152480
8 -0.541767  0.451080 -2.915364
9  0.549072 -1.885768  1.737928

In [51]:
df.to_excel('example.xlsx', 'Sheet1')

In [52]:
!ls

data.h5    example1.csv  example4.csv  example.json  output.json
date.h5    example2.csv  example5.csv  example.xlsx  sample_data
df_pickle  example3.txt  example6.csv  output.csv    ts.csv

In [53]:
pd.read_excel('example.xlsx', 'Sheet1')

    Unnamed: 0         a         b         c
0            0 -0.935313 -1.646714  0.288740
1            1  0.801716 -0.219507 -2.147780
2            2  0.912506 -0.133249 -0.921406
3            3  1.314931 -0.569361  1.144766
4            4  0.369215 -2.479816 -0.349906
..         ...       ...       ...       ...
95          95  1.035640  0.129676 -0.439380
96          96 -0.264234 -0.152521  2.035761
97          97  1.379658  0.848404  1.324203
98          98 -0.207253 -0.428760 -2.058538
99          99  0.154417 -1.049905 -0.229660

[100 rows x 4 columns]

# 데이터 정제

## 누락값 처리

*   대부분의 실제 데이터들은 정제되지 않고 누락값들이 존재
*   서로 다른 데이터들은 다른 형태의 결측을 가짐
*   결측 데이터는 null, NaN, NA로 표기

### None : 파이썬 누락 데이터

In [54]:
a = np.array([1, 2, None, 4, 5])
a

array([1, 2, None, 4, 5], dtype=object)

In [57]:
# a.sum()

### NaN : 누락된 수치 데이터

In [58]:
a = np.array([1, 2, np.nan, 4, 5])
a.dtype

dtype('float64')

In [59]:
0 + np.nan

nan

In [60]:
np.nan + np.nan

nan

In [61]:
a.sum(), a.min(), a.max()

(nan, nan, nan)

In [62]:
np.nansum(a), np.nanmin(a), np.nanmax(a)
# nan값이 있는것을 고려해서 nan값은 무시하고 계산하는 함수

(12.0, 1.0, 5.0)

In [63]:
pd.Series([1, 2, np.nan, 4, None])

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [64]:
s = pd.Series(range(5), dtype=int)
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [65]:
s[0] = None
s

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [67]:
s[3] = np.nan
s

0    NaN
1    1.0
2    2.0
3    NaN
4    4.0
dtype: float64

In [68]:
s = pd.Series([True, False, None, np.nan])
s

0     True
1    False
2     None
3      NaN
dtype: object

### Null값 처리

In [69]:
s = pd.Series([1, 2, np.nan, 'String', None])
s

0         1
1         2
2       NaN
3    String
4      None
dtype: object

In [70]:
s.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [71]:
s[s.notnull()]

0         1
1         2
3    String
dtype: object

In [72]:
s.dropna()

0         1
1         2
3    String
dtype: object

In [73]:
df.dropna(axis='columns')

           a         b         c
0  -0.935313 -1.646714  0.288740
1   0.801716 -0.219507 -2.147780
2   0.912506 -0.133249 -0.921406
3   1.314931 -0.569361  1.144766
4   0.369215 -2.479816 -0.349906
..       ...       ...       ...
95  1.035640  0.129676 -0.439380
96 -0.264234 -0.152521  2.035761
97  1.379658  0.848404  1.324203
98 -0.207253 -0.428760 -2.058538
99  0.154417 -1.049905 -0.229660

[100 rows x 3 columns]

In [74]:
df[3] = np.nan
df

           a         b         c   3
0  -0.935313 -1.646714  0.288740 NaN
1   0.801716 -0.219507 -2.147780 NaN
2   0.912506 -0.133249 -0.921406 NaN
3   1.314931 -0.569361  1.144766 NaN
4   0.369215 -2.479816 -0.349906 NaN
..       ...       ...       ...  ..
95  1.035640  0.129676 -0.439380 NaN
96 -0.264234 -0.152521  2.035761 NaN
97  1.379658  0.848404  1.324203 NaN
98 -0.207253 -0.428760 -2.058538 NaN
99  0.154417 -1.049905 -0.229660 NaN

[100 rows x 4 columns]

In [75]:
df.dropna(axis='columns', how='all')

           a         b         c
0  -0.935313 -1.646714  0.288740
1   0.801716 -0.219507 -2.147780
2   0.912506 -0.133249 -0.921406
3   1.314931 -0.569361  1.144766
4   0.369215 -2.479816 -0.349906
..       ...       ...       ...
95  1.035640  0.129676 -0.439380
96 -0.264234 -0.152521  2.035761
97  1.379658  0.848404  1.324203
98 -0.207253 -0.428760 -2.058538
99  0.154417 -1.049905 -0.229660

[100 rows x 3 columns]

In [80]:
df.dropna(axis='rows', thresh=3)

           a         b         c   3
0  -0.935313 -1.646714  0.288740 NaN
1   0.801716 -0.219507 -2.147780 NaN
2   0.912506 -0.133249 -0.921406 NaN
3   1.314931 -0.569361  1.144766 NaN
4   0.369215 -2.479816 -0.349906 NaN
..       ...       ...       ...  ..
95  1.035640  0.129676 -0.439380 NaN
96 -0.264234 -0.152521  2.035761 NaN
97  1.379658  0.848404  1.324203 NaN
98 -0.207253 -0.428760 -2.058538 NaN
99  0.154417 -1.049905 -0.229660 NaN

[100 rows x 4 columns]

In [81]:
s

0         1
1         2
2       NaN
3    String
4      None
dtype: object

In [83]:
s.fillna(0)

0         1
1         2
2         0
3    String
4         0
dtype: object

In [84]:
s.fillna(method='ffill')

0         1
1         2
2         2
3    String
4    String
dtype: object

In [86]:
s.fillna(method='bfill')

0         1
1         2
2    String
3    String
4      None
dtype: object

In [87]:
df

           a         b         c   3
0  -0.935313 -1.646714  0.288740 NaN
1   0.801716 -0.219507 -2.147780 NaN
2   0.912506 -0.133249 -0.921406 NaN
3   1.314931 -0.569361  1.144766 NaN
4   0.369215 -2.479816 -0.349906 NaN
..       ...       ...       ...  ..
95  1.035640  0.129676 -0.439380 NaN
96 -0.264234 -0.152521  2.035761 NaN
97  1.379658  0.848404  1.324203 NaN
98 -0.207253 -0.428760 -2.058538 NaN
99  0.154417 -1.049905 -0.229660 NaN

[100 rows x 4 columns]

In [88]:
df.fillna(method='ffill', axis=0)

           a         b         c   3
0  -0.935313 -1.646714  0.288740 NaN
1   0.801716 -0.219507 -2.147780 NaN
2   0.912506 -0.133249 -0.921406 NaN
3   1.314931 -0.569361  1.144766 NaN
4   0.369215 -2.479816 -0.349906 NaN
..       ...       ...       ...  ..
95  1.035640  0.129676 -0.439380 NaN
96 -0.264234 -0.152521  2.035761 NaN
97  1.379658  0.848404  1.324203 NaN
98 -0.207253 -0.428760 -2.058538 NaN
99  0.154417 -1.049905 -0.229660 NaN

[100 rows x 4 columns]

In [89]:
df.fillna(method='ffill', axis=1)

           a         b         c         3
0  -0.935313 -1.646714  0.288740  0.288740
1   0.801716 -0.219507 -2.147780 -2.147780
2   0.912506 -0.133249 -0.921406 -0.921406
3   1.314931 -0.569361  1.144766  1.144766
4   0.369215 -2.479816 -0.349906 -0.349906
..       ...       ...       ...       ...
95  1.035640  0.129676 -0.439380 -0.439380
96 -0.264234 -0.152521  2.035761  2.035761
97  1.379658  0.848404  1.324203  1.324203
98 -0.207253 -0.428760 -2.058538 -2.058538
99  0.154417 -1.049905 -0.229660 -0.229660

[100 rows x 4 columns]

In [90]:
df.fillna(method='bfill', axis=0)

           a         b         c   3
0  -0.935313 -1.646714  0.288740 NaN
1   0.801716 -0.219507 -2.147780 NaN
2   0.912506 -0.133249 -0.921406 NaN
3   1.314931 -0.569361  1.144766 NaN
4   0.369215 -2.479816 -0.349906 NaN
..       ...       ...       ...  ..
95  1.035640  0.129676 -0.439380 NaN
96 -0.264234 -0.152521  2.035761 NaN
97  1.379658  0.848404  1.324203 NaN
98 -0.207253 -0.428760 -2.058538 NaN
99  0.154417 -1.049905 -0.229660 NaN

[100 rows x 4 columns]

In [91]:
df.fillna(method='bfill', axis=1)

           a         b         c   3
0  -0.935313 -1.646714  0.288740 NaN
1   0.801716 -0.219507 -2.147780 NaN
2   0.912506 -0.133249 -0.921406 NaN
3   1.314931 -0.569361  1.144766 NaN
4   0.369215 -2.479816 -0.349906 NaN
..       ...       ...       ...  ..
95  1.035640  0.129676 -0.439380 NaN
96 -0.264234 -0.152521  2.035761 NaN
97  1.379658  0.848404  1.324203 NaN
98 -0.207253 -0.428760 -2.058538 NaN
99  0.154417 -1.049905 -0.229660 NaN

[100 rows x 4 columns]

## 중복 제거

In [92]:
df = pd.DataFrame({'c1': ['a', 'b', 'c'] * 2 + ['b'] + ['c'],
                   'c2': [1, 2, 1, 1, 2, 3, 3, 4]})
df

  c1  c2
0  a   1
1  b   2
2  c   1
3  a   1
4  b   2
5  c   3
6  b   3
7  c   4

In [93]:
df.duplicated()
# 중복을 알려주는 메소드

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

In [94]:
df.drop_duplicates()
# 중복을 제거

  c1  c2
0  a   1
1  b   2
2  c   1
5  c   3
6  b   3
7  c   4

## 값 치환

In [95]:
s = pd.Series([1., 2., -999., 3., -1000., 4.])
s

0       1.0
1       2.0
2    -999.0
3       3.0
4   -1000.0
5       4.0
dtype: float64

In [96]:
s.replace(-999, np.nan)

0       1.0
1       2.0
2       NaN
3       3.0
4   -1000.0
5       4.0
dtype: float64

In [97]:
s.replace([-999, -1000], np.nan)

0    1.0
1    2.0
2    NaN
3    3.0
4    NaN
5    4.0
dtype: float64

In [98]:
s.replace([-999, -1000], [np.nan, 0])

0    1.0
1    2.0
2    NaN
3    3.0
4    0.0
5    4.0
dtype: float64